programmingTutorial05/testCase/003-pimpleEnergyFoam/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (1 0 0);

boundaryField
{
    in
    {
        type            fixedValue;
        value           uniform (1 0 0);
    }

    out
    {
        //type            zeroGradient;

	type		inletOutlet;
	phi		phi;
	inletValue	uniform (0 0 0);
	value		uniform (1 0 0);
    }

    cylinder
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    sym1
    {
        type            symmetryPlane;
    }

    sym2
    {
        type            symmetryPlane;
    }

    back
    {
        type            empty;
    }

    front
    {
        type            empty;
    }
}

// ************************************************************************* //
