programmingTutorial05/testCase/003-pimpleEnergyFoam/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    out
    {
        type            patch;
        nFaces          50;
        startFace       25310;
    }
    in
    {
        type            patch;
        nFaces          50;
        startFace       25360;
    }
    cylinder
    {
        type            wall;
        inGroups        1(wall);
        nFaces          80;
        startFace       25410;
    }
    sym1
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          200;
        startFace       25490;
    }
    sym2
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          200;
        startFace       25690;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          12800;
        startFace       25890;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          12800;
        startFace       38690;
    }
)

// ************************************************************************* //
